"""Урок 1. Тема №1. OOП 1: Основы ООП,
Создание первых классов, Атрибуты и Методы классов,
Принцип ООП - Наследование."""

"home work:"

"""
1)создать класс SuperHero 
с cвойством класса people='people'

2)создать конструктор класса(init) с атрибутами 
name,nickname,superpower,health_points,
catchphrase.

3)создать метод который выводит имя героя

4)создать метод который умножает здоровье героя на 2

5) cоздать магический!! метод который 
выводит прозвище героя,его суперспособность и его здоровье

6)создать магический!! метод который считает длину коронной фразы героя

7)создать объект класса Hero
и применить все методы которые вы создали

8) создать репозиторий в github 
9) привязать его с вашим проектом
10)запушить 

"""
